#+TITLE:       PARA Org-mode 测试配置
#+AUTHOR:      lujun9972
#+DATE:        2026-04-15 三
#+LANGUAGE:    zh-CN
#+OPTIONS:     H:6 num:nil toc:t \n:nil ::t |:t ^:nil -:nil f:t *:t <:nil

* 创建目录结构

#+BEGIN_SRC shell :tangle (format "/tmp/para-setup-%s.sh" (user-login-name))
PARA_DIR="$HOME/org"

# 创建 PARA 四层目录
mkdir -p "$PARA_DIR/projects/2026-博客重构"
mkdir -p "$PARA_DIR/projects/2026-Anki插件开发"
mkdir -p "$PARA_DIR/areas/健康"
mkdir -p "$PARA_DIR/areas/财务"
mkdir -p "$PARA_DIR/areas/职业"
mkdir -p "$PARA_DIR/resources/emacs"
mkdir -p "$PARA_DIR/resources/python"
mkdir -p "$PARA_DIR/resources/linux"
mkdir -p "$PARA_DIR/archives"

# 创建 inbox 文件（org-capture 目标）
cat > "$PARA_DIR/projects/inbox.org" << 'EOF'
#+TITLE: Projects Inbox
#+FILETAGS: :project:

,* Projects Inbox
EOF

cat > "$PARA_DIR/areas/inbox.org" << 'EOF'
#+TITLE: Areas Inbox
#+FILETAGS: :area:

,* Areas Inbox
EOF

cat > "$PARA_DIR/resources/inbox.org" << 'EOF'
#+TITLE: Resources Inbox
#+FILETAGS: :resource:
EOF

# 创建 journal 文件
touch "$PARA_DIR/journal.org"

# 创建示例项目文件（供 org-refile 测试）
cat > "$PARA_DIR/projects/2026-博客重构/index.org" << 'EOF'
#+TITLE: 2026 博客重构
#+FILETAGS: :project:

,* TODO 重新设计博客首页
  SCHEDULED: <2026-04-20 日>
,* TODO 迁移到新的静态站点生成器
,* DONE 梳理现有文章分类
  CLOSED: [2026-04-10 四]
EOF

cat > "$PARA_DIR/projects/2026-Anki插件开发/index.org" << 'EOF'
#+TITLE: 2026 Anki 插件开发
#+FILETAGS: :project:

,* TODO 调研 Anki 插件 API
,* TODO 设计卡片模板系统
,* INPROGRESS 编写核心功能代码
EOF

# 创建示例领域文件
cat > "$PARA_DIR/areas/健康/index.org" << 'EOF'
#+TITLE: 健康
#+FILETAGS: :area:

,* 每周运动目标：3 次
,* 年度体检：每年 Q1
,* TODO 预约牙科检查
EOF

cat > "$PARA_DIR/areas/财务/index.org" << 'EOF'
#+TITLE: 财务
#+FILETAGS: :area:

,* TODO 完成 2025 年度报税
  DEADLINE: <2026-05-31 日>
,* 每月记账复盘
EOF

# 创建示例资源文件
cat > "$PARA_DIR/resources/emacs/index.org" << 'EOF'
#+TITLE: Emacs 学习笔记
#+FILETAGS: :resource:

,* Org-mode 技巧
,** 使用 columnview 生成任务报表
,** org-roam 双向链接配置
,* Elisp 常用模式
,** advice-add / advice-remove
,** defmacro 与 defun 的区别
EOF

echo "PARA 目录结构创建完成："
echo ""
tree "$PARA_DIR" 2>/dev/null || find "$PARA_DIR" -type f | sort
#+END_SRC

#+RESULTS:
| PARA                | 目录结构创建完成： |                   |           |
|                     |                    |                   |           |
| /home/lujun9972/org |                    |                   |           |
| ├──                 | archives           |                   |           |
| ├──                 | areas              |                   |           |
| │                   | ├──                | inbox.org         |           |
| │                   | ├──                | 健康              |           |
| │                   | │                  | └──               | index.org |
| │                   | ├──                | 职业              |           |
| │                   | └──                | 财务              |           |
| │                   | └──                | index.org         |           |
| ├──                 | journal.org        |                   |           |
| ├──                 | projects           |                   |           |
| │                   | ├──                | 2026-Anki插件开发 |           |
| │                   | │                  | └──               | index.org |
| │                   | ├──                | 2026-博客重构     |           |
| │                   | │                  | └──               | index.org |
| │                   | └──                | inbox.org         |           |
| └──                 | resources          |                   |           |
| ├──                 | emacs              |                   |           |
| │                   | └──                | index.org         |           |
| ├──                 | inbox.org          |                   |           |
| ├──                 | linux              |                   |           |
| └──                 | python             |                   |           |
|                     |                    |                   |           |
| 13                  | directories,       | 9                 | files     |

